tutorials-OpenFOAM-9/reverseBurner-chtMultiRegionFoamLTS/0/gas/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/gas";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inletFuel
    {
        type            fixedValue;
        value           uniform (0 0.15 0.15);
    }
    inletAir
    {
        type            fixedValue;
        value           uniform (0 0.15 -0.15);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    gas_to_solid
    {
        type            slip;
    }
}


// ************************************************************************* //
