tutorials-OpenFOAM-9/reverseBurner-chtMultiRegionFoamLTS/constant/gas/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/gas/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inletFuel
    {
        type            patch;
        nFaces          4;
        startFace       31516;
    }
    inletAir
    {
        type            patch;
        nFaces          32;
        startFace       31520;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       31552;
    }
    wedgeNeg
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          16000;
        startFace       31592;
    }
    wedgePos
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          16000;
        startFace       47592;
    }
    gas_to_solid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          692;
        startFace       63592;
        sampleMode      nearestPatchFace;
        sampleRegion    solid;
        samplePatch     solid_to_gas;
    }
)

// ************************************************************************* //
