tutorials-OpenFOAM-9/reverseBurner-chtMultiRegionFoamLTS/constant/gas/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/gas";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  P1;

solverFreq      1;

absorptionEmissionModel constant;

constantCoeffs
{
    absorptivity    0.01;
    emissivity      0.01;
    E               0;
}

scatterModel    none;

sootModel       none;


// ************************************************************************* //
